{
  "selectedTemplate": 1,
  "headings": {
    "work": "Work Experience",
    "education": "Education",
    "skills": "",
    "projects": "",
    "certifications": "QUALIFICATIONS"
  },
  "basics": {
    "name": "Shanavas Shakeer",
    "email": "sshakeer@planittesting.com",
    "phone": "+61 481 009 929",
    "summary": "Shanavas is an automation engineer with 7 years of experience into automation testing and he has exposure to various testing tools like HP UFT, Test Complete and Selenium. He also has experience in API testing using rest assured framework. In addition to the above tools, he has worked on open source frameworks like serenity, webdriverIO and BDD Cucumber for Angular and ReactJS based applications. He has automated desktop-based applications using HP UFT and Test Complete tools. He has been involved in setting up continuous integration and testing of applications using Jenkins, OpenShift and was responsible for updating the source code repository using version controlling tools like GIT/SVN. He has knowledge in Excel Macros, HTA Applications and has developed innovative tools which reduced the manual testing efforts.",
    "location": {
      "address": "Sydney, Australia"
    },
    "yearsofexp": "7.5",
    "employeeId": "107659",
    "position": "Test Automation Engineer"
  },
  "education": [
    {
      "institution": "Sri Ramakrishna Engineering College",
      "location": "Anna University",
      "area": "Aeronautical Engineering",
      "studyType": "BE",
      "endDate": "Apr 2012",
      "gpa": "8.7",
      "startDate": "Jul 2008"
    }
  ],
  "work": [
    {
      "position": "Automation Engineer",
      "website": "",
      "highlights": [
        "•\tReporting defects found during testing and Retest the defects if the defect is fixed.",
        "•\tCo-ordination with development team on defect fixes (By helping with testing in Developmental Environment if there are more defects to be fixed).",
        "•\tInvolved in Automation, UAT and Regression,",
        "•\tSend daily status report to the client."
      ],
      "company": "Legal Aid",
      "location": "104, John St, Sydney",
      "startDate": "Dec 2019",
      "endDate": "Aug 2020",
      "projectdescription": "Legal Aid NSW, replaced an existing legacy solution (CASES) with Pega system solution to deliver a new client legal case management solution for legal Aid, available across the web and Integrated into the existing systems. The solution is primarily aimed at internal staff, allowing them capture client and case management information, attach relevant documentations",
      "isplanitEngagement": "yes"
    },
    {
      "highlights": [
        "•\tResponsible for automating the processes like scraping the data from sales force applications and feed the same into mainframe application called Oasis.",
        "•\tResponsible for entire process automation.",
        "•\tInvolved in Automation POC."
      ],
      "company": "SUEZ",
      "position": "Automation Engineer",
      "location": "Rhodes, Sydney",
      "startDate": "FEB 2020",
      "endDate": "Feb 2020",
      "projectdescription": "SUEZ operates largely in the water treatment and waste management sector. Salesforce application is used for service agreement generation and Mainframe application is used for customer creation.",
      "isplanitEngagement": "yes"
    },
    {
      "highlights": [
        "•\tResponsible for designing complex automation test suites/scenarios and frameworks. ",
        "•\tAutomated manual testcases using selenium with TESTNG and serenity framework and create Test Reports using external libraries like extent and allure reporting.",
        "•\tSetup continuous deployment and Integration of applications using Jenkins and Subversion control."
      ],
      "company": "Emirates",
      "position": "Senior Software Engineer",
      "location": "Dubai, UAE",
      "startDate": "Dec 2018",
      "endDate": "OCT 2019",
      "projectdescription": "Emirates airlines has various internal applications to handle network operations related activities which includes crew leave management, Crew allowance and Emergency management systems, the primary focus is to automate all internal applications where it involves of manual efforts for regression testing. Applications are developed on different domain and technologies"
    },
    {
      "highlights": [
        "•\tResponsible for executing test Scripts and test cases",
        "•\tRetesting and closing the defects if the defect is fixed",
        "•\tInvolved in Automation, Sanity, UAT and Regression",
        "•\tPreparing daily interim and EOD report to client with excel macro. "
      ],
      "company": "EY LLP",
      "position": "Senior Test Engineer",
      "location": "Chennai India",
      "startDate": "Feb 2016",
      "endDate": "Nov 2018",
      "projectdescription": ": Morgan Stanley wealth management has various applications, the primary focus of wealth management it focuses on client wealth and property which is controlled by financial analysts. As part of automation testing, we have automated.net, java and angularJS based applications using various automation tools. Reports will be published on dashboard using web services and it will be updated in HP ALM."
    },
    {
      "highlights": [
        "•\tPreparation of test scenario as per the functional and business requirements. ",
        "•\tPreparation of test Scripts and test cases as per the functional and business requirements. Responsible for Data setup activity and executing test Scripts and test cases. Following up with Development team and Environmental set up team in case of any Environment set up failure.",
        "•\tReporting defects found during testing and Retest the defects if the defect is fixed.",
        "•\tCo-ordination with development team on defect fixes (By helping with testing in Developmental Environment if there are more defects to be fixed).",
        "•\tInvolved in Automation, Sanity, ST, SIT and Regression,",
        "•\tPreparing daily interim and EOD report to client with excel macro"
      ],
      "company": "Infosys Limited",
      "position": "Test Engineer",
      "location": "Chennai, India",
      "startDate": "Feb 2013",
      "endDate": "Feb 2016",
      "projectdescription": "RCX- Regional Communication Exchange is the gateway system to process the transactions of commercial disbursements, RCX receives all the transactions from source systems like CD, CFX/GFH, CBII,IMPS,DELPHI –XP .This is a middleware application which gets the transactions from the sources ,process the same and send back to the destination sources like CITIFT or Flex . There are also middleware sources which comes up for specific transactions like PIRS, GI systems."
    }
  ],
  "skills": [
    {
      "level": "",
      "keywords": [
        "Java",
        "VBScript",
        "SQL",
        "VBA"
      ],
      "name": "Programming Language "
    },
    {
      "keywords": [
        "HP ALM/QC",
        "Test Rail",
        "JIRA",
        "HP UFT",
        "Test Complete",
        "Selenium"
      ],
      "name": "Testing tools"
    },
    {
      "keywords": [
        "Oracle",
        "Payments"
      ],
      "name": "SYSTEMS KNOWLEDGE"
    },
    {
      "keywords": [
        "Waterfall",
        "Agile"
      ],
      "name": "Project Methodologies"
    },
    {
      "keywords": [
        "Cypress",
        "WebdriverIO"
      ],
      "name": "JavaScript framework"
    }
  ],
  "projects": [
    {
      "name": "",
      "description": "",
      "url": "",
      "keywords": [
        ""
      ]
    }
  ],
  "certifications": [
    {
      "awarder": "ISTQB",
      "summary": "https://www.certmetrics.com/amazon/electronic_score_report.aspx?exam=912592",
      "date": "2014-06-30",
      "title": "ISTQB Foundation Level (ITB-CTFL-0065135)"
    },
    {
      "title": "AWS Certified Cloud Practitioner",
      "date": "2020-06-12",
      "summary": "https://www.certmetrics.com/amazon/electronic_score_report.aspx?exam=912592",
      "awarder": "AWS"
    },
    {
      "title": "Automation Anywhere Certified Advanced RPA Professional (V11.0)",
      "date": "2019-11-06",
      "summary": "https://certificates.automationanywhere.com/575dae2d-de7a-4476-a809-03a01a758af6#gs.9dmexl",
      "awarder": "Automation Anywhere"
    },
    {
      "title": "Certified Agile Essentials",
      "date": "2019-11-22",
      "awarder": "CAE",
      "summary": "https://zertdb.isqi.org/en/download/certificate/token/kP4YMu81i5NMN5n6"
    }
  ],
  "sections": [
    "profile",
    "education",
    "work",
    "skills",
    "certifications"
  ]
}